{
  "content": [
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": [
            "Crew is a social media startup that connects influencers with brands, aiming to foster a vibrant community where influencers can collaborate, share, and grow. The team at Crew sought a branding that would be familiar to its community while also standing out in the crowded social media landscape."
          ]
        },
        {
          "type": "image",
          "size": "t2",
          "src": "/media/crew/Logo.png",
          "alt": "Crew Logo"
        }
      ]
    },
    {
      "sections": [
        {
          "type": "image",
          "size": "t2",
          "src": "/media/crew/Branding.png",
          "alt": "Crew Branding"
        },
        {
          "type": "text",
          "size": "t",
          "text": [
            "The primary objective was to highlight the playfulness and uniqueness of social media influencers. The branding & design needed to reflect the celebratory and diverse nature of the influencer community."
          ]
        }
      ]
    },
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": [
            "1. User Research: To understand the preferences and behaviors of influencers, we conducted interviews and surveys with a diverse group of influencers. Key findings included a preference for vibrant, playful designs and a desire for branding that felt personal and unique."
          ]
        },
        {
          "type": "text",
          "size": "t",
          "text": [
            "2. Competitive Analysis: We analyzed the branding and design systems of similar platforms, noting a tendency towards clean and professional designs, but with limited visual excitement or playfulness. Their focus was on functionality and partnership management. This highlighted an opportunity for Crew to differentiate itself with a more distinctive and engaging visual approach that reflects the celebratory nature of influencer culture."
          ]
        },
        {
          "type": "text",
          "size": "t",
          "text": [
            "3. Design Inspiration: Inspired by themes of celebration and individuality, we chose confetti as the central theme. Confetti represents festivity, excitement, and a sense of occasion - all qualities that align with the influencer lifestyle and the collaborative nature of Crew."
          ]
        }
      ]
    },
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": [
            "Logo: The redesigned Crew logo features a minimalistic approach with the word 'Crew' prominently displayed. The letters are made up of parts of confetti."
          ]
        },
        {
          "type": "video",
          "size": "t",
          "src": "/media/crew/Design.mp4",
          "alt": "Crew Logo Design"
        }
      ]
    },
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": []
        },
        {
          "type": "image",
          "size": "t",
          "src": "/media/crew/colors4.png",
          "alt": "Crew Colors"
        },
        {
          "type": "text",
          "size": "t",
          "text": [
            "The primary colors of the CMYK color scheme, adjusted for digital screens, were selected to forge a vibrant and eye-catching visual identity. The colors are bold and distinct, and are used individually by major social media platforms. Combining all 3 colors enhanced the playful and energetic nature of the brand."
          ]
        }
      ]
    },
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": [
            "Typography: We went with Satoshi designed by Indian Type Foundry. A modern, sans-serif typeface with clean lines was selected to complement the minimalistic design. This choice ensures readability and aligns with the overall aesthetic of simplicity and clarity."
          ]
        },
        {
          "type": "image",
          "size": "t",
          "src": "/media/crew/typography2.png",
          "alt": "Crew Typography"
        },
        {
          "type": "text",
          "size": "t",
          "text": []
        }
      ]
    }
  ]
}
