{
  "content": [
    {
      "sections": [
        {
          "type": "video",
          "size": "f",
          "src": "/media/human/Portraiture_cc.webm",
          "alt": "Portraiture Performance"
        }
      ]
    },
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": [
            "I wanted to explore the fast paced blur of city life through a performance. The past eight years of my life were spent in Mumbai, an extremely fast paced city. The different lives that I had the opportunity to glimpse all juxtaposed into a blurry collage of one life. And the move to New York City in 2021 only reinforced this idea."
          ]
        },
        {
          "type": "text",
          "size": "t",
          "text": [
            "I started out with an idea of plucking different words from the space around me, to portray that we do have some agency over our lives. But this idea soon gave way to the bleaker tone in the final choreography. Radiohead's 'Fitter Happier' was my immediate choice as the backdrop against which I could perform."
          ]
        }
      ]
    },
    {
      "sections": [
        {
          "type": "image",
          "size": "t",
          "src": "/media/human/Perf_draft1.webp",
          "alt": "Performance Draft 1"
        },
        {
          "type": "text",
          "size": "t",
          "text": [
            "I wanted the final performance to be removed from my human body, to strip it down to its essentials. Hence I decided to use machine learning to map my movements onto an abstract digital entity made completely out of text."
          ]
        },
        {
          "type": "video",
          "size": "t",
          "src": "/media/human/humanConditionPrep_bg.webm",
          "alt": "Human Condition Prep"
        }
      ]
    },
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": [
            "The challenge was to create the shape using AI to map my movements precisely and to keep a consistent form so as to still retain a human-like shape. With changing depth and dimensions during the performance, I had to ensure the code I wrote was robust enough to handle change in font size, word wraps and overwrites automatically in real time."
          ]
        },
        {
          "type": "video",
          "size": "t",
          "src": "/media/human/Portraiture_1.webm",
          "alt": "Portraiture Performance 1"
        }
      ]
    },
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": [
            "The 2-minute song starts with a seemingly positive message about being 'fitter, happier, more productive'."
          ]
        },
        {
          "type": "text",
          "size": "t",
          "text": [
            "This slowly crescendos into the musical chaos much like the haze in our lives."
          ]
        },
        {
          "type": "text",
          "size": "t",
          "text": [
            "And as we reach the denouement, a final callback to the initial 3 phrases 'fitter, happier, more productive' but now with a completely different meaning, presents to us the harsh reality of the lives we're living. The human condition."
          ]
        }
      ]
    },
    {
      "sections": [
        {
          "type": "text",
          "size": "t",
          "text": [
            "I leveraged the jittering the coding produced and added on to it with movement that was irresolute. Open and airy initially, but with time, uncertainty. The performance ends mimicking the lyrics-",
            "'A pig'",
            "'In a cage'",
            "'On antibiotics'",
            "The body closes into itself while the ML engine haphazardly throws the words out as it struggles to decipher the pose."
          ]
        },
        {
          "type": "video",
          "size": "t2",
          "src": "/media/human/Portraiture_2.webm",
          "alt": "Portraiture Performance 2"
        }
      ]
    }
  ]
}
